#pragma once
#include <sdk/defines.h>
#include <sdk/math/vec3.h>
#include <interfaces/model_info.h>
#include <sdk/utils/netvars.h>
#include "../utils/utilities.h"
#include "collideable.h"
#include <interfaces/client.h>
#include <array>


class base_entity;
class c_weapon;
class animstate;
class player_resource;
class vec3_t;
class vec2_t;
class IRecipientFilter;
class CBreakableSurface;
class usercmd;

enum animstate_pose_param_idx_t
{
	PLAYER_POSE_PARAM_FIRST = 0 ,
	PLAYER_POSE_PARAM_LEAN_YAW = PLAYER_POSE_PARAM_FIRST ,
	PLAYER_POSE_PARAM_SPEED ,
	PLAYER_POSE_PARAM_LADDER_SPEED ,
	PLAYER_POSE_PARAM_LADDER_YAW ,
	PLAYER_POSE_PARAM_MOVE_YAW ,
	PLAYER_POSE_PARAM_RUN ,
	PLAYER_POSE_PARAM_BODY_YAW ,
	PLAYER_POSE_PARAM_BODY_PITCH ,
	PLAYER_POSE_PARAM_DEATH_YAW ,
	PLAYER_POSE_PARAM_STAND ,
	PLAYER_POSE_PARAM_JUMP_FALL ,
	PLAYER_POSE_PARAM_AIM_BLEND_STAND_IDLE ,
	PLAYER_POSE_PARAM_AIM_BLEND_CROUCH_IDLE ,
	PLAYER_POSE_PARAM_STRAFE_DIR ,
	PLAYER_POSE_PARAM_AIM_BLEND_STAND_WALK ,
	PLAYER_POSE_PARAM_AIM_BLEND_STAND_RUN ,
	PLAYER_POSE_PARAM_AIM_BLEND_CROUCH_WALK ,
	PLAYER_POSE_PARAM_MOVE_BLEND_WALK ,
	PLAYER_POSE_PARAM_MOVE_BLEND_RUN ,
	PLAYER_POSE_PARAM_MOVE_BLEND_CROUCH_WALK ,
	//PLAYER_POSE_PARAM_STRAFE_CROSS,
	PLAYER_POSE_PARAM_COUNT ,
};


struct animstate_pose_param_cache {
	std::uint8_t pad_0x0[ 0x4 ]; //0x0
	std::uint32_t m_idx; //0x4
	char* m_name;
	void set_value( base_entity* e , float val );
	//0x8
};

enum data_update_type_t {
	data_update_created = 0 ,
	data_update_datatable_changed
};

class animstate {
public:
	std::uint8_t pad_0x0000[ 0x4 ]; //0x0000
	bool force_update; //0x0005 
	std::uint8_t pad_0x0006[ 0x5A ]; //0x0006
	base_entity* entity; //0x0060 
	c_weapon* weapon; //0x0064 
	c_weapon* last_weapon; //0x0068 
	float last_clientside_anim_update; //0x006C 
	std::uint32_t last_clientside_anim_framecount; //0x0070 
	float last_clientside_anim_update_time_delta; //0x0074 
	float eye_yaw; //0x0078 
	float pitch; //0x007C
	float abs_yaw; //0x0080 
	float feet_yaw; //0x0084 
	float body_yaw; //0x0088 
	float body_yaw_clamped; //0x008C 
	float feet_vel_dir_delta; //0x0090 
	std::uint8_t pad_0x0094[ 0x4 ]; //0x0094
	float feet_cycle; //0x0098 
	float feet_yaw_rate; //0x009C 
	std::uint8_t pad_0x00A0[ 0x4 ]; //0x00A0
	float duck_amount; //0x00A4 
	float landing_duck_additive; //0x00A8 
	std::uint8_t pad_0x00AC[ 0x4 ]; //0x00AC
	vec3_t origin; //0x00B0 
	vec3_t old_origin; //0x00BC 
	vec2_t vel2d; //0x00C8 
	std::uint8_t pad_0x00D0[ 0x10 ]; //0x00D0
	vec2_t last_accelerating_vel; //0x00E0 
	std::uint8_t pad_0x00E8[ 0x4 ]; //0x00E8
	float speed2d; //0x00EC 
	float up_vel; //0x00F0 
	float speed_normalized; //0x00F4 
	float run_speed; //0x00F8 
	float duck_speed; //0x00FC 
	float time_since_move; //0x0100 
	float time_since_stop; //0x0104 
	bool on_ground; //0x0108 
	bool hit_ground; //0x0109 
	std::uint8_t pad_0x010A[ 0x4 ]; //0x010A
	float time_in_air; //0x0110 
	std::uint8_t pad_0x0114[ 0x6 ]; //0x0114
	float ground_fraction; //0x011C 
	std::uint8_t pad_0x0120[ 0x2 ]; //0x0120
	float unk_fraction; //0x0124 
	std::uint8_t pad_0x0128[ 0xC ]; //0x0128
	bool moving; //0x0134
	std::uint8_t pad_0x0135[ 0x7B ]; //0x0135
	animstate_pose_param_cache lean_yaw_pose; //0x1B0
	animstate_pose_param_cache speed_pose; //0x01BC
	animstate_pose_param_cache ladder_speed_pose; //0x01C8
	animstate_pose_param_cache ladder_yaw_pose; //0x01D4
	animstate_pose_param_cache move_yaw_pose; //0x01E0
	animstate_pose_param_cache run_pose; //0x01EC 
	animstate_pose_param_cache body_yaw_pose; //0x01F8
	animstate_pose_param_cache body_pitch_pose; //0x0204
	animstate_pose_param_cache dead_yaw_pose; //0x0210
	animstate_pose_param_cache stand_pose; //0x021C
	animstate_pose_param_cache jump_fall_pose; //0x0228
	animstate_pose_param_cache aim_blend_stand_idle_pose; //0x0234
	animstate_pose_param_cache aim_blend_crouch_idle_pose; //0x0240
	animstate_pose_param_cache strafe_yaw_pose; //0x024C
	animstate_pose_param_cache aim_blend_stand_walk_pose; //0x0258
	animstate_pose_param_cache aim_blend_stand_run_pose; //0x0264
	animstate_pose_param_cache aim_blend_crouch_walk_pose; //0x0270
	animstate_pose_param_cache move_blend_walk_pose; //0x027C
	animstate_pose_param_cache move_blend_run_pose; //0x0288
	animstate_pose_param_cache move_blend_crouch_pose; //0x0294
	std::uint8_t pad_0x02A0[ 0x4 ]; //0x02A0
	float vel_unk; //0x02A4 
	std::uint8_t pad_0x02A8[ 0x86 ]; //0x02A8
	float min_yaw; //0x0330 
	float max_yaw; //0x0334 
	float max_pitch; //0x0338 
	float min_pitch; //0x033C

	void update( const vec3_t& ang );

	bool& m_smooth_height_valid( )
	{
		return *reinterpret_cast< bool* >( uintptr_t( this ) + 0x328 );
	}
};

struct animlayer {
	PAD( 20 );
	int	order;
	int	sequence;
	float previous_cycle;
	float weight;
	float weight_delta_rate;
	float playback_rate;
	float cycle;
	void* owner;
	PAD( 4 );
};

class c_bone_accessor {
public:
	int get_readable( ) {
		return m_readable;
	}

	void set_readable( int flags ) {
		m_readable = flags;
	}

	int get_writeable( ) {
		return m_writeable;
	}

	void set_writeable( int flags ) {
		m_writeable = flags;
	}

	const matrix_t& get_bone( int bone ) const {
		return m_bones[ bone ];
	}

	matrix_t& get_bone_for_write( int bone ) {
		return m_bones[ bone ];
	}

	std::array< matrix_t , 128 >& get_bone_arr_for_write( ) const {
		return m_bones;
	};

	const void* m_animating;
	std::array< matrix_t , 128 >& m_bones;
	int m_readable;
	int m_writeable;
};
class BoneArray : public matrix_t {
public:
